<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class StatusCode extends Model
{
    public function status($code){
        $statuscode = array(
            /* 参数错误： 10001-19999*/
            10001 => "有参数未携带",
            10002 => "有参数为空",
            10003 => "文章标题长度小于5",
            10004 => "文章类型既不是'经验'也不是'问题'",
            10005 => "用户名已存在",
            10006 => "密码长度小于6位",

            /* 登陆： 20001-29999*/
            20001 => "用户未登录",
            20002 => "token已过期",
            20003 => "用户名或密码错误",
            20004 => "用户不存在",
            20005 => "用户已存在",
            20006 => "认证已存在",

            /* 岗位 30001-39999 */
            30001 => "创建失败",

            /* 不存在：40001-49999 */
            40001 => "文章不存在",
            40002 => "岗位不存在",
            40003 => "评论与文章不匹配",
            40004 => "评论与岗位不匹配",
            40005 => "回复与评论不匹配",
            40006 => "公司不存在",
            40007 => "岗位与公司不匹配",
           

            /* 回答/评论：50001-599999 */
            50001 => "数据未找到",
            50002 => "数据有误",
            50003 => "数据已存在",

            /* 回复：60001-69999 */
            60001 => "内部系统接口调用异常",
            60002 => "外部系统接口调用异常",
            60003 => "该接口禁止访问",
            60004 => "接口地址无效",
            60005 => "接口请求超时",
            60006 => "接口负载过高",

            /* 权限错误：70001-79999 */
            70001 => "只有标签 Owner ,才具备删除权限",
            70002 => "此认证标签已有员工认证，不可以进行删除"

        );

        return $statuscode[$code];

    }

    
}
 

